* Electronic wafermapping
** Automatic fill in collection plan
*** DONE Call with ati
    SCHEDULED: <2011-01-24 Mon>
**** Prepare
     CLOCK: [2011-01-24 Mon 09:34]--[2011-01-24 Mon 11:01] =>  1:27
***** mail sent at 14/09/2010
**** Organize regular follow up calls                                   :erp:
***** Weekly at 1:30pm on monday
**** Arrange week at Erfurt?
*** Tasks
**** Oracle
     SCHEDULED: <2011-02-07 Mon>
***** TODO Send message when a lot is finished               :shopfloor:intf:
***** TODO Fill in collection plan                           :shopfloor:intf:
**** Rtwm DB
***** TODO Send message when a wafermap is finished
      SCHEDULED: <2011-02-21 Mon>
**** Wafermapping
***** Erfurt
****** TODO Postprocessing
****** TODO TH01 convert
***** Sofia
****** TODO Postprocessing
****** TODO TH01 convert
***** Ieper
****** TODO Postprocessing
****** TODO TH01 convert
***** TODO Extract good number of dies
      SCHEDULED: <2011-02-14 Mon>
      CLOCK: [2011-02-21 Mon 09:24]--[2011-02-21 Mon 11:42] =>  2:18

***** TODO Send good number of dies
      SCHEDULED: <2011-02-14 Mon>
***** TODO Start postprocessing
      SCHEDULED: <2011-02-14 Mon>
***** TODO Routing
      SCHEDULED: <2011-02-28 Mon>
***** TODO Exception handling
*** Questions
**** Will this system handle INK_TH01 in Erfurt
**** Add jem to the flow
**** Can postprocessing in Ieper also be executed on wafer base?
**** How will th01 convert know which file to convert?
***** TODO Get the wafermaps for a lot
      CLOCK: [2011-02-21 Mon 11:43]

*** Next actions
**** DONE Define interfaces for systems                                 :brh:
     :CLOCK:
     CLOCK: [2011-01-24 Mon 13:58]--[2011-01-24 Mon 14:10] =>  0:12
     CLOCK: [2011-01-24 Mon 11:04]--[2011-01-24 Mon 11:28] =>  0:24
     :END:
interfaces.org
**** DONE Create deployment diagram for electronic wafermapping
     CLOCK: [2011-01-24 Mon 14:11]--[2011-01-24 Mon 16:19] =>  2:08
**** TODO Interfaces from postprocessing                                :ati:
**** TODO Check shopfloor interface document
     :CLOCK:
     CLOCK: [2011-01-25 Tue 10:43]--[2011-01-25 Tue 10:44] =>  0:01
     CLOCK: [2011-01-25 Tue 09:14]--[2011-01-25 Tue 10:43] =>  1:29
     :END:
**** DONE INKLESS-433 Inkless not working for devices with 2 different itemnumbers
     SCHEDULED: <2011-02-03 Thu> DEADLINE: <2011-02-07 Mon>
     :CLOCK:
     CLOCK: [2011-01-27 Thu 13:23]--[2011-01-27 Thu 13:53] =>  0:30
     CLOCK: [2011-01-27 Thu 10:38]--[2011-01-27 Thu 12:14] =>  1:36
     CLOCK: [2011-01-27 Thu 10:14]--[2011-01-27 Thu 10:28] =>  0:14
     CLOCK: [2011-01-27 Thu 09:16]--[2011-01-27 Thu 10:03] =>  0:47
     CLOCK: [2011-01-26 Wed 09:05]--[2011-01-27 Thu 09:16] => 24:11
     CLOCK: [2011-01-25 Tue 10:45]--[2011-01-26 Wed 09:05] => 22:20
     :END:
     :PROPERTIES:
     :ORDERED:  t
     :END:
     Splitted in branch for refactoring and for this ticket.
***** TODO Add INKLESS-517 to this issue
**** TODO Create planning with dates for collection plan import
     SCHEDULED: <2011-01-31 Mon>
     :CLOCK:
     CLOCK: [2011-01-31 Mon 09:16]
     CLOCK: [2011-01-27 Thu 10:12]--[2011-01-27 Thu 10:13] =>  0:01
     CLOCK: [2011-01-27 Thu 10:12]--[2011-01-27 Thu 10:12] =>  0:00
     :END:
     :PROPERTIES:
     :ORDERED:  t
     :END:
**** DONE INKLESS-570 After change of subcontractor of an item,  the shopfloor interface does not pick up the new settings
     DEADLINE: <2011-02-03 Thu>
     CLOCK: [2011-01-27 Thu 14:01]--[2011-01-27 Thu 14:36] =>  0:35
***** Added partner to the list of fields to check.
***** TODO Verify in -test
** Inkless
*** Meetings
**** Inkless 19/01
**** partner 1.3.0
**** ready for uat
***** thursday or friday
**** DONE mirrored server for leister and xfab                    :todo:TODO:
     SCHEDULED: <2011-01-24 Mon> DEADLINE: <2011-01-26 Wed>
     CLOCK: [2011-01-27 Thu 10:28]--[2011-01-27 Thu 10:28] =>  0:00
Created ticket

**** partner 1.2.7
***** incident with carsem
**** p&t setup priority list for partner
***** DONE filter list for things that have already been done          :todo:
      SCHEDULED: <2011-01-24 Mon> DEADLINE: <2011-01-26 Wed>
      CLOCK: [2011-01-24 Mon 16:49]--[2011-01-24 Mon 17:16] =>  0:27
      :PROPERTIES:
      :ORDERED:  t
      :END:
**** update release number on partner-ui
**** inkless littered with incidents
**** deployment diagram for inkless and partner                     :ARCHIVE:
**** Inkless 26/01
***** partner 1.3.0
****** DONE create package for partner 1.3.0
       SCHEDULED: <2011-01-27 Thu>
       CLOCK: [2011-01-27 Thu 10:03]--[2011-01-27 Thu 10:09] =>  0:06
***** partner 1.2.7
****** wafermaps didn't arrive at carsem 1
******* explained how we got a timeout when confirming wafermaps

**** Inkless 27/01
***** TODO Rotate wafermaps after downloading them in Inkless. :rotate:issue:PRTNR:4:
***** TODO Add possibility configure a wafermap to be rotated. :rotate:issue:PRTNR:4:
***** DONE Ask Peter to know more about Pactech and Continental

**** Inkless 23/02
***** partner 1.3 uat
****** waiting for tests on -test
****** ask fpl or ggo for to verify a test
****** TODO the verified flag isn't showing for mpd lots            :blocker:
Not a blocker
***** inkless 1.30
****** owning entity
****** electronic wafermapping 1.31 with different components
****** TODO ask pti to join next meeting
       SCHEDULED: <2011-03-01 Tue>
***** planning

**** Inkless 02/03
***** fpl, mcl, ggo, jut, brh
***** parter 1.3
****** shopfloor and partner split from each other                     :CRAB:
****** testplan to automate the acceptance testing
****** GO
***** inkless 1.30
****** GO no go on friday
***** planning roadmap
***** open tickets and issues
*** Auto fill in collection plans
*** Sent mail to ati                                         :mail:follow:up:
*** DONE Create planning for project                                    :ati:
    DEADLINE: <2011-01-25 Tue>

** Partner
*** DONE Create package for partner 1.3.0
    SCHEDULED: <2011-01-25 Tue>
** Continental
*** Requirements
**** Send wafermaps to pactech
***** amkor format
***** after probing                                                :question:
****** confirmed by ggo on 15/03/2011
**** Import wafermaps from pactech
***** amkor format
***** postprocessing                                               :question:
****** yes,  ggo on 15/03/2011
***** import data in oracle                                        :question:
****** not top priority,  ggo on 15/03/2011
**** Send shipping request to pactech
***** TODO ask jut for format and transport
      SCHEDULED: <2011-02-16 Wed>
***** which format                                                 :question:
***** which transport                                              :question:
**** Send wafermaps to continental
***** triggered when postprocessing is finished
***** conti format
***** only when wafermaps from pactech are sent
***** Send confirmation to pactech to send                           :format:
***** assume that pactech sends wafermaps to continental
***** wait for confirmation by continental that the wafermaps are received
**** Postprocessing
***** Start postprocessing
***** Import results in Oracle                                     :question:
***** Move in Oracle                                               :question:
**** Services
***** Inkless service with input event,  output a collection of valid wafermaps
*** .plan
**** interfaces document
     CLOCK: [2011-02-16 Wed 09:53]--[2011-02-16 Wed 12:52] =>  2:59
1d
**** setup service bus
Created ticket to create ewaf
0.5d
**** post errors on topic
0.5d
**** shopfloor interface
***** lot shipped
1d
**** wmapdb interface
***** wafermaps for lot
      CLOCK: [2011-02-23 Wed 10:45]--[2011-02-23 Wed 11:17] =>  0:32

1d
**** config
     :CLOCK:
     CLOCK: [2011-02-23 Wed 15:14]
     CLOCK: [2011-02-23 Wed 11:33]--[2011-02-23 Wed 15:01] =>  3:28
     :END:

2d
***** device config
***** item config
***** lot config
***** site config
**** validations
***** pass dies
1d
***** postprocessing
0.5d
***** row / columns
0.5d
**** camel routings
1d
**** workflow
2d
**** pactech convertor
0.5d
**** conti convertor
0.5d
**** ship wafermaps message
1d
----
~ 13d




